Repository: AliKssab/iOSBaseApp
Catalog: iOSBaseApp2/07.Shared/03.Presentaion/Resources/Localization/ValidationMessages.xcstrings
Source language: en
Languages: ar

# err_confirm_password_empty
source: Confirm password must not be empty
ar: تأكيد كلمة المرور لا يجب أن يكون فارغًا

# err_confirm_password_mismatch
source: Passwords do not match
ar: كلمة المرور غير متطابقة

# err_email_empty
source: Email must not be empty
ar: البريد الإلكتروني لا يجب أن يكون فارغًا

# err_email_invalid
source: Invalid email format
ar: صيغة البريد الإلكتروني غير صحيحة

# err_field_max_length
source: Maximum length is %d characters
ar: الحد الأقصى للطول هو %d حروف

# err_field_min_length
source: Minimum length is %d characters
ar: الحد الأدنى للطول هو %d حروف

# err_field_required
source: This field is required
ar: هذا الحقل مطلوب

# err_name_empty
source: Name must not be empty
ar: الاسم لا يجب أن يكون فارغًا

# err_name_invalid
source: Name must contain only letters
ar: الاسم يجب أن يحتوي فقط على حروف

# err_new_password_same_as_current
source: New password can’t match current.
ar: كلمة المرور الجديدة لا يمكن أن تتطابق مع كلمة المرور الحالية.

# err_password_empty
source: Password is required
ar: كلمة المرور مطلوبة

# err_passwords_not_matching
source: Passwords do not match
ar: كلمتا المرور غير متطابقتين

# err_phone_empty
source: Phone number must not be empty
ar: رقم الجوال لا يجب أن يكون فارغًا

# err_phone_invalid
source: The phone number must begin with the number 5
ar: يجب أن يبدأ رقم الهاتف بالرقم 5
